[
{"title": "Product Manager (Big Data Operation and Marketing)", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Product Manager (Big Data Operation and Marketing) Bank of China (Hong Kong) Limited Not Specified Posted on 15 Apr 2019 Product Manager (Big Data Operation and Marketing) Bank of China (Hong Kong) Limited Job Highlights Job Description  494885 : Full time  Innovation and Optimization Centre : Business Development, Product Development & Management, Project Management, Marketing Responsibilities: Be responsible for event planning and execution of big data, make up marketing and sales KPI and follow up the process; decide the internal event theme and arrangements, coordinate different\r\n departments and allocate resources appropriately, promote and optimize the business marketing activities Have a deep mind through industry, product and customers, be expert in customer analysis, PERSONA, help developing data product and exploring new product model by data analysis; provide\r\n advice on business process and outcome and help to implement Be responsible for building evaluation system on product, operation and active users; use statistical modeling and data analysis to make up suggestions on product, operation and market Be responsible for customer behavior investigation, calculate the income and cost by massive data mining and analysis Build up daily report forms system and handle everyday statistics processing, support operating department with accurate, practical and measurable data \r\n \r\n Requirements： Degree or above in Science and Engineering, Mathematics, Statistics or related field, preferably graduating from distinguished universities 3+ year work experience with at least 1-year experience in new media, digital marketing or big data marketing strategy of internet media Have a deep understanding of big data, have a strong background of big data marketing consultation, planning or analysis, be able to seize characters from massive data and be sensible\r\n to data Have a good understanding of internet business model, be familiar with internet and finance industry, be sensitive to the hot point and trends, be proficient in mobile internet digital\r\n marketing and have built up good relationship with related customers, well-performed in passed career Have good market insights, be proficient in planning, coordinating, negotiating, have excellent skills to study and solve the problem \r\nWe offer competitive remuneration package and comprehensive fringe benefits including medical and life insurance, and different types of allowances to the right candidates. Interested parties, please submit your application by clicking Apply Now. For details,\r\n please visit our website  http://www.bochk.com Data collected would be used for recruitment purposes only. Applicants who do not hear from us within 8 weeks may consider their application unsuccessful\r\n and their data will be destroyed within 24 months of receipt. Additional Information Career Level Senior Qualification Degree Industry Job Function Years of Experience 3 years Employment Type Full Time Benefits Life insurance, Medical insurance Company details Join Bank of China (Hong Kong) \r\nBe a dynamic member of our team We commit to excellence and professionalism We value people We offer challenging and rewarding careers that will further your personal development \r\n More Jobs from this employer Part-time Clerk Posted on  4 hours ago Business Strategy Officer (SAS Analyst) Posted on  4 hours ago Senior Operation Officer (RMB Clearing) Posted on  16-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "BI / Data warehouse / Big Data Architect ($80-100K)", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs BI / Data warehouse / Big Data Architect ($80-100K) Captiare Limited Not Specified Salary provided Posted on 21 Mar 2019 BI / Data warehouse / Big Data Architect ($80-100K) Captiare Limited Job Highlights Job Description Our client is looking for an experienced big data professional to join their well-established data team and manage large-scale projects. The candidate should apply his / her strong data modelling and software engineering knowledge and solid development experience in data analytics and data warehousing to design data architecture for a complex analytics application REQUIREMENTS University degree in Computer Science or related discipline An expert in data analytics / data warehousing / data modelling / software engineering / BI best practices, etc. Strong ability to lead from requirements gathering to design and implementation phases Good knowledge on data migration from legacy to new solutions Excellent communication and problem-solving skills   Interested parties please  CLICK HERE   to apply online. Please note that only shortlisted candidates will be notified. All information gathered will be treated in strict confidence and solely used for recruitment purposes. Kindly  CLICK HERE  for more job opportunities on our  website. Additional Information Career Level Not Specified Qualification Not Specified Industry Job Function Years of Experience Not Specified Employment Type Full Time Company Website Company details  is one of the leading Technology recruitment firm. We have 10 years’ track record of providing professional recruitment services for well-known MNCs, Banks, Regulatory institutions. The spectrum ranges across industries from the world's largest financial services institutions and blue-chips companies to medium-sized businesses and even the entrepreneurial start-ups. Our consultants possess a unique blend of professional search experiences and industry expertise. More Jobs from this employer System Analyst - Java Posted on  23 hours ago Network Specialist - Leading Manufacturer Posted on  23 hours ago Human Resources Business Partner (About $40K/ Perm/ Banking) Posted on  16-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Analyst Programmer / Programmer (Big Data)", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Analyst Programmer / Programmer (Big Data) NewTrek Systems Limited Kwun Tong Salary negotiable Posted on 20 Mar 2019 Analyst Programmer / Programmer (Big Data) NewTrek Systems Limited Job Highlights Job Description Analyst Programmer / Programmer (Big Data)    Research and Development of AI Solutions Perform Data Management and Data Analytics  Analyze structured and unstructured data, visualize findings and discover insights via data modelling, machine learning and optimization technique Build Real-time Integration Capabilities from data source and analytic platform to customer touch points Collaborate with a broad spectrum of stakeholders, including Technical Expertise and Development Teams, etc.   Diploma / Degree holder in IT or related discipline Minimum 1 years’ working experience in system development Solid experience in Data Analytics Hands on experience in Java, Python, R, Spark, Node.js and SQL Solid experience in conducting business and system analysis with strong business acumen Good analytical, good interpersonal and communication skills Good command of spoken and written English and Chinese Additional Information Career Level Entry Level Qualification Degree Industry Job Function Years of Experience 1 year Employment Type Full Time, Permanent Benefits Five-day work week Company Website Company details NewTrek Systems Ltd. ,  a member of the New World Group, is a leading provider of IT consulting and outsourcing services with sales and client support offices located in China, Hong Kong and the U.S.    To build one of the best solution delivery teams  and to cope with NewTrek’s rapid expansion, we have immediate requirements for the following IT professionals to be based in Hong Kong. In addition to a competitive remuneration package, a robust career path within the growing Company will be offered to the successful applicants. More Jobs from this employer .NET Analyst Programmer / Programmer (Multiple Vacancies) (5 days) Posted on  28-Mar-19 Analyst Programmer (Java) Posted on  25-Mar-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Presales Consultant / Product Manager - FinTech (AI, Big Data, NLP, Chatbot, Cloud)", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Presales Consultant / Product Manager - FinTech (AI, Big Data, NLP, Chatbot, Cloud) Premier Aegis Recruitment Not Specified HK$45,000 - 70,000 /month (negotiable) Posted on 22 Mar 2019 Presales Consultant / Product Manager - FinTech (AI, Big Data, NLP, Chatbot, Cloud) Premier Aegis Recruitment Job Highlights Job Description Our client is a leading FinTech player with their subsidiary to grow rapidly these two years. They are looking for a consultant/ product manager to join their team for their solution and product R&D in business growth.  Job Responsibilities: Identify, analyze, and understand the banking & finance clients needs to earn higher market shares Work with internal/ external teams and vendors/ partners to design solutions that can best cater the key clients requirements and meeting up-to-date banking & finance compliance in HK region Fully support Sales with clients-facing. Closely communicate with Project and Product development team on R&D and solution delivery Introduce and increase client awareness of the offering AI solutions/ products that best to clients needs and can highly improve the operational cost and effectiveness Conduct presentation, technical materials for demonstration that addressing specifically of problem solution to clients and their needs  Support full sales cycles, helping with strategy, competitive positioning and proposals Requirements: B achelor’s Degree in Computer Science, Business or other related field. Strong analytical, problem solving and process and solution oriented abilities Attractive remuneration package and excellent career prospects will be provided to the right candidate.  Interested parties please send full resume with expected salary to   com All applications and data collected will be treated in strict confidence and used exclusively for recruitment purposes only    Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience 3 years Employment Type Full Time, Permanent Benefits Dental insurance, Double pay, Education allowance, Five-day work week, Life insurance, Medical insurance, Performance bonus, Transportation allowance, Travel allowance Company details Premier Aegis is a recruitment consulting firm based in Hong Kong. We hit the ground running with our direct approach to pair fresh talents and top employers. We developed our recruitment services to be centered on our clients' and candidates' need, to help both parities achieve sustained growth with their most complex challenges. In which, we have successfully engaged the top companies include listed companies, Fortune 500 and MNC in the region. We cater to all level recruitment services within IT&T, Property & Construction, Engineering, Sales & Marketing, Legal, HR & Admin, Financing & Accounting, Secretarial & other public functions.  For more information, please visit: www.premieraegis.com More Jobs from this employer Senior Project Manager / Project Manager (Fitting out Works / A&A works) Posted on  17 hours ago Design Coordinator / Assistant Designer Posted on  15-Apr-19 Sales Manager / Large Account Manager / Account Director/ BDM Posted on  15-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Senior/ IT Manager - power BI - 80K", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Senior/ IT Manager - power BI - 80K Captiare Limited Not Specified Salary provided Posted on 17 Apr 2019 Senior/ IT Manager - power BI - 80K Captiare Limited Job Highlights Job Description Additional Information Career Level Not Specified Qualification Not Specified Industry Job Function Years of Experience Not Specified Employment Type Full Time, Permanent Company Website Company details  is one of the leading Technology recruitment firm. We have 10 years’ track record of providing professional recruitment services for well-known MNCs,\r\n Banks, Regulatory institutions. The\r\n spectrum ranges across industries from the world's largest financial services institutions and blue-chips companies to medium-sized businesses and even the entrepreneurial start-ups. Our consultants possess a unique blend of professional search experiences\r\n and industry expertise. More Jobs from this employer System Analyst - Java Posted on  23 hours ago Network Specialist - Leading Manufacturer Posted on  23 hours ago Human Resources Business Partner (About $40K/ Perm/ Banking) Posted on  16-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Software Engineer", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Software Engineer Big Data Architect Limited Kowloon Bay Salary negotiable Posted on 22 Mar 2019 Software Engineer Big Data Architect Limited Job Highlights Job Description Job Duties: Web application system development and implementation System architect and technical design System tool and application solution evaluation Resolves any malfunctioning and errors in hardware configuration, operating systems and application programs. The appointee may need to work on customer site for specific project when required.   Requirements: Degree or above in computer science, information technology or related disciplines; At least 1 year working experience in (i) software application maintenance or development using a structured methodology; AND (ii) technical support in server installation, network architecture, database administration, system security; Proficient in Windows Server; Proficient in Microsoft SQL Server/ mySQL / Oracle RDBMS; Proficient in J2EE /ASP.Net/ PHP / HTML / mobile application development;  Experience in web-based application development or Open Source applications development / implementation, database administration and data warehousing is an advantage. Good oral and written communication skills in both Chinese and English; Business knowledge in health care industry, architectural, engineering and construction industry is an advantage.  Has a genuine and demonstrable interest in information technology above and beyond the requirements of the position is preferable. Recent graduate with strong skill sets will be considered. We offer five-day work week (except certain Saturdays according to specific project requirements). Interested parties are invited to submit their full resume in word format with current and expected salary by clicking \"Apply Now\" below.  Application without salary information will not be considered.   All personal information collected will be used for recruitment purpose only. Additional Information Career Level Entry Level Qualification Degree Industry Job Function Years of Experience 1 year Employment Type Full Time, Permanent Benefits Double pay, Five-day work week, Free shuttle bus Company details B ig Data Architect Limited (BDA) has an objective to provide effective big data analytics for clients from a variety of industries, using contemporary technologies. The pursuit of BDA is to apply cognitive computing in the business practices. To capitalize clients’ data as a strategic asset, BDA identifies key insights within their internal and/or external data, thereby enabling better business decisions. The underlined principles of the company are honesty, innovation, and efficiency. The team is made up of skillful and well experienced technical experts in the IT industry.  Please visit our company web-site via www.bigdatarchitect.com to explore more on our business and services. About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Master Data Management Officer (Kwai Hing) 11539【Big and Stable 】", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Master Data Management Officer (Kwai Hing) 11539【Big and Stable 】 Reeracoen Hong Kong Co., Limited Kwai Hing Salary provided Posted on 25 Mar 2019 Master Data Management Officer (Kwai Hing) 11539【Big and Stable 】 Reeracoen Hong Kong Co., Limited Job Highlights Job Description Client Background Our client is a  Japanese Logistics Company. They are finding potential candidate to join this position. Job Description ・Support for ensuring master data integrity in International (Ocean & Air) Freight Forwarding operating system as well as maintaining the processes to keep and improve the data quality ・Perform daily Master Data Maintenance and monitor data quality ・Create Material, Policies and Guidelines for Master Data Maintenance Person specification ・Ability to work with system users to elicit and formally define their requirements; ・2 years' experience in global forwarder operation (CargoWise One, Optional is preferable); ・Fluent English speaking & writing ・Ability to work on own initiative within agreed boundaries ・Immediately available preferred   Salary & Benefit package - Competitive Salary - MPF - Annual leaves - Medical Insurance - Double Pay - Bonus  - Business Transportation allowance        If you are passionate, driven and looking for a new and exciting opportunity, this may be the right role for you. Please click “ ” to submit your application. All personal information submitted by job applicants will be used for recruitment purposes and we reserve the rights to consider the applications for other positions in our Group. Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience 2 years Employment Type Full Time Benefits Double pay, Five-day work week, Medical insurance, Performance bonus, Transportation allowance Company details Reeracoen (Hong Kong)       More Jobs from this employer Supply Chain Planner ( N2 Japanese ) ( Kwun tong ) 11302【Mega multinational technology company 】 Posted on  41 mins ago Analyst ( Central ) 12154【Famous Financial Service Company】 Posted on  1 hour ago ( Hotel Project ) Senior Project Designer ( Quarry Bay ) 12153【Famous Design Company】 Posted on  1 hour ago View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Product Manager (Python/ SQL/ AI/ Big Data)- 45k", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Product Manager (Python/ SQL/ AI/ Big Data)- 45k Ambition Others Salary negotiable Posted on 19 Mar 2019 Product Manager (Python/ SQL/ AI/ Big Data)- 45k Ambition Job Highlights Job Description Additional Information Career Level Senior Qualification Degree Industry Job Function Years of Experience 5 years Employment Type Full Time, Permanent Company Website Company details More Jobs from this employer HR Director Posted on  5 hours ago Accounts Assistant Posted on  6 hours ago Senior Sales Lead - Digital Transformation Platform Posted on  7 hours ago View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Master Data Management Officer (Kwai Hing) 11234【Big and Stable 】", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Master Data Management Officer (Kwai Hing) 11234【Big and Stable 】 Reeracoen Hong Kong Co., Limited Kwai Hing Salary provided Posted on 25 Mar 2019 Master Data Management Officer (Kwai Hing) 11234【Big and Stable 】 Reeracoen Hong Kong Co., Limited Job Highlights Job Description Client Background Our client is a  Japanese Mega Logistics Company. They are searching a potential candidate to join this position. Job Description ・Support for ensuring master data integrity in International (Ocean & Air) Freight Forwarding operating system as well as maintaining the processes to keep and improve the data quality especially from IT system point of view. ・Perform daily master data maintenance; ・Support Master Maintenance manager to implement shipment type distinguish process; ・Support Master Maintenance team to redefine user roles and responsibilities; ・Support and execute system migration activities; ・Perform data patching ・Monitor and reinforce agent code creation procedure; ・Support master data governance and monitor data quality.   Person specification ・Previous knowledge of any global forwarder operation (Cargowise 1, Optional is preferable); ・Degree holder in information management or data governance related qualification is preferable or at least 3 years experience working in an information or data governance setting for the applicant with lower qualification; ・Ability to work with system users to elicit and formally define their requirements; ・With 5 years' experience in managing international logistics ocean freight operations; ・Proficiency in written and verbal English skills, with the ability to create clear requirements, specifications and documentation; ・Ability to work on own initiative within agreed boundaries;  ・Immediately available preferred.   Salary & Benefit package - Competitive Salary - MPF - Annual leaves - Medical Insurance - Double Pay - Bonus (depends on company's performance) - Business Transportation allowance        If you are passionate, driven and looking for a new and exciting opportunity, this may be the right role for you. Please click “ ” to submit your application. All personal information submitted by job applicants will be used for recruitment purposes and we reserve the rights to consider the applications for other positions in our Group. Additional Information Career Level Senior Qualification Degree Industry Job Function Years of Experience 5 years Employment Type Full Time Benefits Double pay, Five-day work week, Medical insurance, Performance bonus, Transportation allowance, Travel allowance Company details Reeracoen (Hong Kong)       More Jobs from this employer Supply Chain Planner ( N2 Japanese ) ( Kwun tong ) 11302【Mega multinational technology company 】 Posted on  41 mins ago Analyst ( Central ) 12154【Famous Financial Service Company】 Posted on  1 hour ago ( Hotel Project ) Senior Project Designer ( Quarry Bay ) 12153【Famous Design Company】 Posted on  1 hour ago View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Product Manager (Python/ SQL/ AI/ Big Data)- 45k", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Product Manager (Python/ SQL/ AI/ Big Data)- 45k Ambition Others Salary negotiable Posted on 01 Apr 2019 Product Manager (Python/ SQL/ AI/ Big Data)- 45k Ambition Job Highlights Job Description Additional Information Career Level Senior Qualification Degree Industry Job Function Years of Experience 5 years Employment Type Full Time, Permanent Company Website Company details More Jobs from this employer HR Director Posted on  5 hours ago Accounts Assistant Posted on  6 hours ago Senior Sales Lead - Digital Transformation Platform Posted on  7 hours ago View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Assistant Project Manager - Big Data", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Assistant Project Manager - Big Data A.S. Watson Retail (HK) Limited Shatin Area Salary provided Posted on 02 Apr 2019 Assistant Project Manager - Big Data A.S. Watson Retail (HK) Limited Job Highlights Job Description The position will be responsible for managing Big Data and Data Science projects from inception through kick-off and into deployment\r\n between ASW Group system teams and external solution vendors. Responsibilities:  Manage project milestones, deliverables, tasks, schedules and project-related reporting requests Manage expectations of project stakeholders and project team members through Project Charter and regular, formal status update meetings Lead cross-functional, geographically dispersed, virtual project members Proactively manage risks, issues and tasks to break down barriers and get decisions made to ensure project is completed on time with high\r\n quality Organize communications and presentations related to project progress and risks for project stakeholders and executives Implement change management tools and processes in the projects. Job Requirements Bachelor’s degree in Engineering, Computer Science, Information Systems, or, Business Administration with a concentration in Information Systems 2-4 years of experience in project management Project management knowledge and development methodologies such as waterfall and agile is a mus Experience managing/leading a small cross functional project team Understanding of Big Data and software development is highly preferred Must be a strong communicator with a high level of written and verbal business communication skill, preferably with multi-cultural, multi-regional project management experience Experience with integration projects and productionalization is highly preferred Technical knowledge such as SQL, R or Python is highly preferred Proficient in MS Excel, Word, PowerPoint, MS Project Fluency in English and\r\n Mandarin is preferable. We are an equal opportunity employer and welcome applications from all qualified candidates. The information provided will be treated in strict confidence and be used only\r\n for consideration of your application for relevant / similar posts within the A.S. Watson Group. Applicants not hearing from us within 6 weeks from the date of advertisement may consider their applications unsuccessful. All\r\n personal data of unsuccessful applicants will be destroyed within 12 months from the date of application.    Additional Information Career Level Not Specified Qualification Not Specified Industry Job Function Years of Experience Not Specified Employment Type Full Time, Permanent Benefits Five-day work week, Performance bonus Company Website Company details is what we bring to life, every single day.  has set the standard since 1841 – and we’ve only just begun. A.S. Watson (ASW) is the largest international health and beauty retailer in Asia and Europe with over 14,100 stores in 24 markets. Each year, over three billion customers and members shop with our well-known retail brands. Everyday, we bring   to\r\n life through our 12 retail brands including Watsons, Kruidvat, Trekpleister, Rossmann, Superdrug, Savers, Drogas, ICI PARIS XL, The Perfume Shop, PARKnSHOP, FORTRESS and Watson’s Wine. At ASW, it is our vision to be the world’s leading health, beauty and lifestyle retailer, and with such ambition in mind we work tirelessly to put a smile on\r\n our customers’ faces, in order to deliver our commitment “We bring   to life” – to our customers, colleagues, communities and shareholders. Inspired by our passionate commitment “ ”\r\n is at the heart of the movement at ASW connecting brilliant talent around the world by inspiring them with the higher purpose of working at ASW – “Bringing   to\r\n life” by making people healthy and beautiful.  isn’t just a job. It’s your share in the global success of our brands. Together we’re   than you can imagine.  When the Hong Kong Dispensary opened its doors to customers 175 years ago, nobody could’ve imagined it would one day grow into the A.S. Watson Group we know today. The A.S. Watson Group story is already an extraordinary one. But there’s much more to come. Help us write the next chapter. Join us, and  !    If you are interested to know more about our global brands, explore our different teams and hear our amazing employees’ stories, please\r\n visit our career website,  www.aswatsoncareers.com .    You are welcome to register at our career website for job application or directly send your full resume with expected salary to A.S. Watson Group\r\n HR by email:  [email protected] .       More Jobs from this employer Supply Chain Officer (Regional role for Asia) Posted on  8 hours ago Store Clerk 店鋪文員 Posted on  16-Apr-19 Database Administrator (Oracle products, Shell Script, Linux/Unix) Posted on  16-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Big Data Engineer", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Big Data Engineer Swing Consulting Limited Kwun Tong Salary negotiable Posted on 29 Mar 2019 Big Data Engineer Swing Consulting Limited Job Highlights Job Description : Involve in data visualization, data modeling and ETL development projects Perform design, develop and testing function for ETL mapping and workflow in a large Data Warehouse environment Assist Data Scientist to develop AI / machine learning solution for data analytic Perform Business Intelligent report generation according to users’ requirements Assist in system testing including prepare test plan and test cases for evaluating system performance   Diploma or in Big Data / Computer Science or other related discipline At least 1 year’s hands-on experience in software development, preferable knowledge and concept in Big Data / Artificial Intelligence Familiar with Python or other similar libraries for web scrapping and data analytics is highly preferred. Familiar with Big Data Platform tools and applications development Knowledge in database system such as Sybase IQ, Oracle, MySQL, PostgreSQL, MongoDB, Greenplum, Bigtable, Cassandra, etc. Knowledge of BI tools like QlikView, Tableau and SAS Visual Analytics is an advantage Willing to learn, passionate in Big Data area Self-motivative, able to work independently Fresh Guard also welcome; Candidate with more experience will be consider as Data Analyst / Senior Data Engineer   Please send your full resume with MS Word format to us  by\r\n email  or  fax: 3426 2763,  or\r\n you may click the  Apply Now  button\r\n below.  For any enquiries, please call Ms. Karen Lam at 2126 7548 or 9801 0808. Join us on facebook www.facebook.com/swinghk \r\n   Additional Information Career Level Entry Level Qualification Non-Degree Tertiary Industry Job Function Years of Experience 1 year Employment Type Full Time Benefits Five-day work week Company Website Company details Swing Consulting Limited [email protected] More Jobs from this employer System Engineer Posted on  12-Apr-19 Project Manager (Infrastructure/Application) Posted on  12-Apr-19 Network Specialist Posted on  12-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Associate Director / Manager – Big Data Practitioner, Data & Analytics", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Associate Director / Manager – Big Data Practitioner, Data & Analytics KPMG Central Salary provided Posted on 29 Mar 2019 Associate Director / Manager – Big Data Practitioner, Data & Analytics KPMG Job Highlights Job Description In KPMG's Management Consulting practice, we do not limit ourselves to either strategy or implementation. Instead, we deliver both. Our team in Hong Kong is the fastest growing division within KPMG China and represents a young and enthusiastic team that always pushes itself to succeed. Since our creation, we have developed in-depth knowledge of an incredibly broad spread of sectors and services. Our Data & Analytics team focuses on assisting clients to execute their strategy by optimising the use of information. We enable business to realise their objectives through insights from the data and provide the right information to the right people at the right time. The role of an Associate Director within KPMG has three specific areas of focus: 1. Business Development - Building strong and lasting client relationships through excellent interpersonal skills - Identifying and developing new opportunities at existing and new clients - Working with Partners and Directors to develop compelling propositions which target relevant client issues - Supporting the development of RFP responses to clients - Building their network within the firm to help drive the capability and their own visibility 2. Client Service - Delivery of high quality advisory and / or technical services to our clients - Planning, managing and executing the delivery of engagements or projects, including responsibility for the review and quality assurance of deliverables - Building lasting relationships with their key client stakeholders - Identifying and managing risks, whilst maximising profitability and ensuring the Firm's frameworks are implemented appropriately and effectively 3. Practice Development - Utilising their previous and growing experience to build and develop knowledge within the team - Developing and building on both their consulting and delivery capability - Delivery and attendance to key training - Helping our junior team members to develop through mentoring and monitoring in the role of a Performance Manager and by disseminating their own experience throughout the team As part of this team, you will be providing specialised consulting services in Big Data Strategy, Planning and Implementation to clients across different industries The individual will have: - Bachelor's degree, preferably in Computer Science, Information Systems, and Engineering - 10+ years of Big Data and data warehousing experience, candidates with less experience will be considered as Manager - Hands-on experience in leading the design, development and implementation of the big data software platform - Extensive understanding of database and analytical technologies including MPP and NoSQL databases, data warehousing, BI, and Dashboard design - Extensive understanding of Hadoop technologies. Programming or scripting languages like Java, Linux, C++, PHP, Ruby, Python, R and Matlib - Expert knowledge in different (NoSQL or RDBMS) databases such as Hbase, Hive, MongoDB and Cassandra - Strong understanding of cloud technologies platform like AWS or Azure is highly preferred - Great communications skill to work with business stakeholders on analytics, project management, and advisory - Proven project management skills including planning, designing and shaping project work streams, managing progress, resolving issues and limiting risks - Ability to work at pace whilst delivering pragmatic and high quality outcomes - Good English language skills. Prefer to be fluent on Mandarin We offer successful candidates an attractive remuneration package and the opportunity to work in a dynamic and exciting environment. Personal data collected will be used for recruitment purposes only. © 2019 KPMG, a Hong Kong partnership and a member firm of the KPMG network of independent member firms affiliated with KPMG International Cooperative (\"KPMG International\"), a Swiss entity. All rights reserved. Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience 10 years Employment Type Full Time Company Website Company details KPMG China operates in 19 cities across China, with around 12,000 partners and staff in Beijing, Beijing Zhongguancun, Changsha, Chengdu, Chongqing, Foshan, Fuzhou, Guangzhou, Hangzhou, Nanjing, Qingdao, Shanghai, Shenyang, Shenzhen, Tianjin, Wuhan, Xiamen, Xi'an, Hong Kong SAR and Macau SAR.   KPMG is a global network of professional services firms providing Audit, Tax and Advisory services. We operate in 154 countries and territories, and have 200,000 people working in member firms around the world.  More Jobs from this employer Equity Derivatives Sales, Vice President to Director Posted on  11 mins ago Administrator, Private Equity Posted on  5 hours ago System Administrator Posted on  16-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Big Data Developer", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Big Data Developer Trustme Chain Corporation Limited Central Salary provided Posted on 29 Mar 2019 Big Data Developer Trustme Chain Corporation Limited Job Highlights Job Description Responsibilities: Serve as the SME for data & reporting solution within and across teams.  Identify and implement process enhancement opportunities associated with supporting the application area. Help to change the company to a data-driven organization Enhance the current DataLake solution to meet the reporting requirements and data request for business initiatives and be the single point of contacts for all such requests on top of the DataLake/Tableau. Work with upstream Fintech and business teams to identify appropriate and correct data sources to be loaded into the DataLake based on users’ requests. Ensure a proper governance of data and an efficient data processing platform on the Datalake Maintain a detailed and complete data-dictionary about the Datalake. Being the gatekeeper to ensure quality of technology delivery by vendor for multiple concurrent projects at maximum capacity   Requirements: Bachelor’s degree in computer science, engineering or related discipline At least 4 years working experience after graduation 2 years or above experience in Tableau reporting & dashboarding (this is important) 1 years or above experience in Python programming skills with pandas, Numpy, Scipy, BeautifulSoup, openapi or other similar libraries (in areas like data analysis, ETL & web scraping) 3 years or above experience in SQL programming skills Solid technical BA skills in requirement gathering and user management (specific in BI area), including business and process analysis skills Experienced in (big data) BI modelling skills   Nice to have skills: Tableau Server management skills Big Data development experience especially in MapR StreamSet, PySpark, Kafka or Flink Linux shell scripts development Loan industry (either personal or property)  knowledge   We offer: Discretionary bonus Medical insurance Dental insurance Hardship allowance Competitive annual leave days Birthday leave Anniversary leave Family care days Study leave Marriage leave Extra maternity leave with full paid Extra paternity leave with full paid Compassionate leave Home-made soup and dessert   How to apply: Please send your resume with expected salary either by the function \"APPLY NOW\" or post Postage address: Human Capital Department trustMe Chain Corporation Limited 4/F Wheelock House, 20 Pedder Street Central Hong Kong   (We are an equal opportunity employer. Personal data collected will be used for recruitment purpose only. The unsuccessful applications will be destroy ed after 6 months.) Additional Information Career Level Entry Level Qualification Non-Degree Tertiary Industry Job Function Years of Experience 3 years Employment Type Full Time, Permanent Benefits Dental insurance, Five-day work week, Medical insurance, Performance bonus Company details WE INNOVATE. WE CREATE. WE CONNECT. A technology innovator and forerunner in Blockchain technology A forerunner in Blockchain technology, we have developed a business blockchain platform “trustME”, the first of its kind in Hong Kong to bring transformative and disruptive innovation across industries. We focus on bringing emerging technologies to help organizations to accelerate their business goals by adopting advanced technologies to stay ahead of the competition. At trustME, we foster a culture of innovation, continuous improvement and collaboration. We strive to develop our talent and support life-long learning to fulfil their personal growth and career aspirations. To cope with our rapid expansion, we are currently looking for passionate and talented people to join our growing team. More Jobs from this employer System Analyst Posted on  08-Apr-19 Senior Analyst Programmer Posted on  04-Apr-19 Sales Executive Posted on  04-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Digital Media Officer (5 day work)", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Digital Media Officer (5 day work) Social Big Data Limited Kwun Tong Salary provided Posted on 02 Apr 2019 Digital Media Officer (5 day work) Social Big Data Limited Job Highlights Job Description Job Responsibilities   A Strong understanding of integrated communications, brand development and multichannel marketing concepts; Lead on the team in  all parts of creative process – to come up with compelling, well-structured and innovative digital/integrated creative campaigns that’s align with the overall strategy; Compose and guide proposals in English for regional and global digital and integrated projects with strategy, approach, expected outcomes matching with clients’ KPIs, being able to create Chinese proposal is a plus; Create compelling, well-structured and innovative digital creative campaigns that’s align with the overall strategy; Synthesize and effectively communicate insights and creative idea with execution team; Keep current with emerging digital technology, creative marketing strategies and social insights for internal and external training; Guide or review creative proposals to ensure the proposal clearly demonstrate how the creative idea/strategy delivers on the business needs and focus on results and measurement .   Job Requirements   Bachelor degree in Communications, PR, Journalism, Media, Marketing, Business, Advertising or related disciplines; 1-2 years above of work experience in creating creative marketing campaigns, preferably in digital marketing or social media fields; Very strong creative skills and like to think “outside box” – Intensely curious and ability to question conventional wisdom; A natural user of social media – Facebook, Twitter, Instagram, Pinterest and etc.; Entrepreneurial - this team is inventing every day and it takes tenacity, bravery and the ability to see the big opportunities to thrive; Must be able to work independently; Excellent command of English writing and presentation, Mandarin/Cantonese is a plus; Highly personable with collaborative spirit;   Interested parties, please send us a full resume with present and expected salary to Miss Tong by clicking     button or email to   hkvlogger.com         Personal data collected will be treated in strict confidence and used only for recruitment-related purpose. Applicants who have not heard from us within four weeks may consider their applications unsuccessful.  All personal data will be destroyed after 6 months. Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience 1 year Employment Type Full Time Benefits Dental insurance, Five-day work week, Medical insurance Company details Social Big Data Limited More Jobs from this employer Merchandising Executive Posted on  11-Apr-19 Graphic Designer Posted on  11-Apr-19 Digital Media Officer (5 day work) Posted on  22-Mar-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Lead Consultant - IoT/Big Data/Cloud - Presales", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Lead Consultant - IoT/Big Data/Cloud - Presales Argyll Scott Asia Others HK$35,000 - 70,000 /month (negotiable) Posted on 02 Apr 2019 Lead Consultant - IoT/Big Data/Cloud - Presales Argyll Scott Asia Job Highlights Job Description Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience 5 years Employment Type Full Time, Permanent Company Website Company details More Jobs from this employer Corporate Development Analyst/Associate Posted on  4 hours ago Head of Strategy and Corporate Development - Asset Management Posted on  4 hours ago HR Manager (Banking) Posted on  12-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Assistant Computer Officer(s) (Machine Learning, Big Data, AI, Neural Networks)", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs  Assistant Computer Officer(s) (Machine Learning, Big Data, AI, Neural Networks)  The Chinese University of Hong Kong Shatin Area Salary provided Posted on 05 Apr 2019  Assistant Computer Officer(s) (Machine Learning, Big Data, AI, Neural Networks)  The Chinese University of Hong Kong Job Highlights Job Description Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience 3 years Employment Type Full Time Company Website Company details About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Advisory - Data & Analytics - Senior Big Data Architect", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Advisory - Data & Analytics - Senior Big Data Architect EY Central Salary negotiable Posted on 03 Apr 2019 Advisory - Data & Analytics - Senior Big Data Architect EY Job Highlights Job Description Additional Information Career Level Senior Qualification Degree Industry Job Function Years of Experience 10 years Employment Type Full Time Company details More Jobs from this employer Advisory - Risk Transformation - Senior / Manager / Senior Manager (Archer Implementation) Posted on  19 hours ago Advisory – Performance Improvement (Digital) – Manager / Senior Associate Posted on  19 hours ago Advisory - Risk - Technology Risk - Manager / Senior Associate Posted on  19 hours ago View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Financial Data Analyst - Cryptocurrency (CTA strategy, python / C++ / Java, big data)", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Financial Data Analyst - Cryptocurrency (CTA strategy, python / C++ / Java, big data)  RecruitPRO Consultancy Hong Kong Limited Central & Western Area Salary provided Posted on 04 Apr 2019 Financial Data Analyst - Cryptocurrency (CTA strategy, python / C++ / Java, big data)  RecruitPRO Consultancy Hong Kong Limited Job Highlights Job Description Our client is a new startup investment company. They are now looking for: Financial Data Analyst - Cyptocurrency Duties: Research and perform analysis on market and trade data CTA strategy and market trends development\r\n Requirements: Degree or above in Finance, Mathematics, Statistics, Computer Science and any other related disciplines 2 years or above related working experience\r\n Experience to use Python / C++ / Java to analyze big data of the market \r\n Experience to develop models and CTA stategy Good at both written and spoken of English and Chinese   Please kindly send your CV in WORD format ONLY with: CURRENT and EXPECTED SALARY AVAILABILITY JOB TITLE in your EMAIL SUBJECT Additional Information Career Level Senior Qualification Degree Industry Job Function Years of Experience 2 years Employment Type Full Time, Permanent Benefits Five-day work week, Performance bonus Company Website Company details Starting from 2009, Recruit PRO  is a Hong Kong based recruitment consultancy\r\n and executive search firm serving clients range from  \r\n .   The key to the success of any business is\r\n people . At RecruitPRO, our goal is to provide the\r\n right talents  to meet for your\r\n business growth Whether you are a candidate looking for a career opportunity or an employer looking to staff an important position,\r\n Recruit is the solution for you.   website:\r\n www.recruitpro662.com Employer enquiry hotline: 852 2388 7911   For Employer enquiry use only: \r\n com For\r\n Job Seekers directly apply use \r\n only : \r\n *All personal data collected will be kept confidential and be used for recruitment related purpose only.* More Jobs from this employer Project Sales Executive (Tender) - building materials (government / developer / main contractor) Posted on  5 hours ago Admin & Sales Coordination Clerk - 5.5 days alt. Sat, Kowloon Bay, double pay, 15- 16K Posted on  7 hours ago Strategic Partnership Manager (Tourism) Posted on  16-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Sales Manager, AI & Big Data Analytics", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Sales Manager, AI & Big Data Analytics  Clustertech Limited Shatin Area Salary provided Posted on 04 Apr 2019 Sales Manager, AI & Big Data Analytics  Clustertech Limited Job Highlights Job Description To grow our business in advance technology, we are looking for high calibre sales candidates to join our HK sales team. Reporting to the Head of Hong Kong Business Development, this new hunter will focus on generating new business for our Artificial Intelligence (AI)/Machine Learning (ML)/Big Data Analytics products and services for enterprises and government departments. You can manage complex opportunities with multiple stakeholders; You enjoy the autonomy of creating solutions for your clients; You like to solve business problems with advanced technologies with your solution selling skills; Formulate and implement business strategies to achieve sales target; Identify new business opportunities and penetrate new accounts; Develop and maintain good customer relationship to uncover customer business needs and generate demand; Develop and deliver compelling customer presentations to articulate business and/or technical value of our solutions and services; Work with pre-sales to scope projects and formulate solutions; Primarily work in Hong Kong, with occasional traveling to the Mainland China; Less experienced candidate may be considered for Sales Manager position; Requirements: University graduates in any disciplines; Minimum 5 years solid sales experiences serving enterprise or government clients; Solution integrator or technology consulting experience is preferred; Technical knowledge in data mining, text mining is definitely a plus; Existing extensive network and contacts in the relevant vertical industry/market; Track record of over-achieving quota in past direct sales positions; Complete comfort in working at all levels of the organization; Self-motivated, aggressive, independent and dependable team player; Good communication, interpersonal and presentation skills with good command of written and spoken English, Mandarin and Cantonese; Remuneration Package: Excellent remuneration package with attractive commission scheme. Feel excited already? Go to   to take a look at our solutions and products! We offer competitive remuneration package including 5-day work and 15 days annual leave to the right candidate with excellent career advancement.  All applications will be treated in strict confidence. Personal information collected will be used solely for the purpose of recruitment. If you are not invited for an interview within 4 weeks, your application will be filed for a further 2 years and be considered for any other appropriate positions within the company or related companies.   For more information about  ClusterTech , please visit our web site at  . Additional Information Career Level Not Specified Qualification Not Specified Industry Job Function Years of Experience Not Specified Employment Type Full Time, Permanent Benefits Five-day work week, Life insurance, Medical insurance Company Website Company details ClusterTech  Limited   is committed to providing value to clients through advanced computing technologies including Cloud, High Performance Computing,  AI & Analytics and  Big Data. We provide a comprehensive range of services and products to solve problems in massive data processing, large-scale computing, in-depth analysis, artificial intelligence, and uninterrupted service. Our business areas include financial engineering (investment analysis, risk management, derivatives pricing, etc.), business intelligence (sales forecasting, customer management, inventory management, etc.), environmental science (weather forecast, heavy rain and turbulence forecasting, analysis and prediction of pollution, etc.), smart city (information gathering, information analysis, optimisation and management), and internet applications (massive image processing, video storage and delivery). We also provide public cloud, private cloud and hybrid cloud solutions for businesses of all sizes. More Jobs from this employer Assistant Marketing Manager / Senior Marketing Executive Posted on  04-Apr-19 Data Scientist / Computational Scientist Posted on  04-Apr-19 Designer Posted on  04-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Big Data Management and Governance Specialist Engineer", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Big Data Management and Governance Specialist Engineer Asia Miles Limited Tung Chung Salary negotiable Posted on 09 Apr 2019 Big Data Management and Governance Specialist Engineer Asia Miles Limited Job Highlights Job Description Big Data Management Help to participate in Big Data Lake projects and maintain it in good operational order Help on automating Data Science models Help to on-boarding unstructured and structured Data processes Collect and translate Business User’s Data usages and requirements into Master Data Domains, Enforce and evaluate procedures for controlling business rules are correctly applied to data at the time of collection. Manage the Data Access Controls and user’s access recertification. Help to detect, report and fix any Data Security issue within AML’s business context. Data Governance Support implementation of data governance action plans and mobilise stakeholders across AML and CX (Review PIA, Review PICS statement, Data Registry, etc…) Maintain and execute Data Governance framework, polices and guidelines. Identify and recommend on measures and controls on data governance. Other exposure in Regulatory Compliance, and Audits Identify potential compliance issue base on AML’s business context Help to answer and reply to Internal and External Auditors for any Data Governance related questions. Degree holder in Computer Science, Information Systems or other relevant subject area Minimum 5 years of experience in data management and/or data governance related area Exposure to at least one end-to-end implementation of a data platform, i.e. data-warehouse, data mart or OLAP (online analytical processing) Exposure to at least one end-to-end successful implementation of a Data Registry project and / or an MDM (Master Data Management) in a sizeable environment. Knowledge of Big Data is preferred but not mandatory. Team player and strong stakeholder management skills. Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience 5 years Employment Type Full Time, Permanent Benefits Dental insurance, Five-day work week, Life insurance, Medical insurance, Performance bonus, Transportation allowance Company details Asia Miles, Asia’s leading travel and lifestyle rewards programme, was launched in February 1999 and has\r\n and  worldwide. Asia Miles aims to deliver\r\n and offers members extensive opportunities to earn miles by spending daily from a wide range of travel and lifestyle categories including flights, hotels, dining, financial services, retail, technology brands and much more. With\r\n , Asia Miles members can earn miles when flying to more than 1,000 destinations worldwide. With\r\n to choose from, Asia Miles offers one of the largest ranges of lifestyle food & beverage options in Asia to earn miles. In addition to flight awards, Asia Miles members can also redeem miles and enjoy fabulous awards such as hotel stays at 60,000 hotels, car rental services in\r\n 20 countries and over 35,000 lifestyle and experience awards. Asia Miles is open to anyone aged 2 or above and is\r\n . Managed and operated by Asia Miles Limited, the travel and lifestyle rewards programme is a wholly owned subsidiary of Cathay Pacific Airways Limited. More Jobs from this employer Planning Specialist Posted on  14 mins ago Flight Attendant – Cathay Pacific/ Cathay Dragon (Hong Kong Base) Posted on  17 hours ago Solution Analyst - HR Systems Posted on  16-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Full-Stack Software Engineer – C/Python – Machine Learning/AI/ Big Data - Perm", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Full-Stack Software Engineer – C/Python – Machine Learning/AI/ Big Data - Perm Wellesley Associates Limited Not Specified Salary provided Posted on 11 Apr 2019 Full-Stack Software Engineer – C/Python – Machine Learning/AI/ Big Data - Perm Wellesley Associates Limited Job Highlights Job Description Background My client is a well-funded Fintech startup company who is developing on an Enterprise-Level AI solution using the most advanced technology. They\r\n are now looking for good potential candidates to join their solution development team   Job Description\r\n Solid understanding on browser behaviours, design patterns, data structures and algorithms Perform hands-on programming on the platform applications using nontraditional and innovative tools such as the latest AI Technologies Enjoy finding ways to improve and propose feasible solutions, ideas or features Deploy, debug and test across browser and platform applications Work closely with a the data-science and product team to deliver the best AI product Prepare documentations on the application design and coding   Requirement BSc, MSc or PhD degree in Computer Science, Software Engineering, Mathematics  or\r\n other equivalent disciplines Good hands-on experience in the followings:\r\n C and Python JavaScript frameworks such as React/Redux, webpack, HTML5/LESS or any other relevant, (ES7/Typescript is a plus) Web service frameworks Sanic/Koa or any other relevant. Microservices architecture, RESTful APIs, (GraphQL is a plus) NoSQL/SQL database like MongoDB, (Elastic Search is a plus) Machine learning framework like Tensorflow/Keras/SciKit is a plus. Experience in building progressive web application is a plus. Strong desire to learn and self-improve\r\n Enjoy working at a tech- diverse and flexible environment\r\n Uphold a high quality standard attitude and take pride of self-built product Excellent communication skills in Cantonese, Mandarin and English Candidates with more or less years of experience will also be considered   If you would like to apply for this role or find out more, please contact\r\n 2847 9958  and apply online with your latest CV in\r\n  including current & expected salary Kindly note that only shortlisted candidates will be notified. Additional Information Career Level Not Specified Qualification Not Specified Industry Job Function Years of Experience Not Specified Employment Type Full Time Company details More Jobs from this employer Senior Project Implementation Manager - Cloud Solution/Product –  US-Based Fortune 500 Posted on  5 hours ago Account Executive - Tech firm/ Global MNC/ 22K+ Posted on  22 hours ago HR Manager/ Business Partner - 60K+ Posted on  22 hours ago View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "AVP/Manager, Big Data Analytics & Machine Learning", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs AVP/Manager, Big Data Analytics & Machine Learning China Construction Bank (Asia) Corporation Limited Kowloon Bay Salary negotiable Posted on 11 Apr 2019 AVP/Manager, Big Data Analytics & Machine Learning China Construction Bank (Asia) Corporation Limited Job Highlights Job Description Job Description: Explore the availability, access and transformation/ use of unstructured data (browsing data, voice, email, picture, videos) for analytics and customer contact purpose Facilitate and hands-on develop advanced analytics/ Machine Learning-based solutions to uplift effectiveness of analytics, modelling and customer contact riding on (i) supervised/ unsupervised Machine Learning techniques (ii) unstructured data e.g. digital footprint Drive study, development and business implementation of speech and text analytics Integration of customer external and internal data, structured and unstructured Develop close-loop learning path and ensure insights and learnings are carried out for continuous customer interactions As the Subject Matter Expert, trainer and advocate to uplift the machine learning skillset and culture of existing analysts pool Requirements:  3-5 years' of hands-on experience in developing and executing large scale analytics deliverables/ projects in the Financial Services Industry Deep experience in applying artificial intelligence and machine learning techniques/algorithms, infused with industry knowledge, to enhance business strategies Strong in transforming analytical concepts and developments into business strategies and applications for the uplift of business value Solid experience in training analysts on machine learning techniques Effective presentation, communication and interpersonal skills Great sense of ownership and servicing mindset to ensure efficient and effective customer service processes * Please state your current and expected salary in the application as a reference.  Applicants who are not contacted within 8 weeks may consider their applications unsuccessful and their personal data will be retained by the bank for a period up to two years. All information provided by applicants will be used for recruitment purposes only and will be used strictly in accordance with the bank’s personal data policies, a copy of which will be provided upon request. Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience 3 years Employment Type Full Time Benefits Five-day work week, Life insurance, Medical insurance Company Website Company details China Construction Bank (Asia) Corporation Limited [“CCB (Asia)”] is the retail and commercial business platform of China Construction Bank Corporation [“CCB”] in Hong Kong. As of June 30, 2017, CCB (Asia) has 50 branches in Hong Kong and offers a wide array of banking products and services to customers, including consumer banking services, commercial banking services, corporate banking services, private banking services and cross-border financial services, etc.    We’re inviting high caliber professionals to share our vision and mark our success together. More Jobs from this employer Relationship Manager Trainee (May 2019 Intake) Posted on  5 hours ago Manager, Property & Facility Management Posted on  16-Apr-19 Wealth Planning Advisor (Insurance focused)   (Ref. no.: WPAI/CB/JDB) Posted on  16-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Marketing Intern - (Big Data Analytics & Machine Learning)", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Marketing Intern - (Big Data Analytics & Machine Learning) China Construction Bank (Asia) Corporation Limited Kowloon Bay Salary negotiable Posted on 11 Apr 2019 Marketing Intern - (Big Data Analytics & Machine Learning) China Construction Bank (Asia) Corporation Limited Job Highlights Job Description Job Description:   Explore the availability, access and transformation/ use of unstructured data (browsing data, voice, email, picture, videos) for analytics and customer contact\r\n purpose Assist advanced analytics/ Machine Learning-based solutions to uplift effectiveness of analytics, modelling and customer contact riding on (i) supervised/ unsupervised\r\n Machine Learning techniques (ii) unstructured data e.g. digital footprint Assist the study, development and business implementation of speech and text analytics Requirements:   Knowledge of modelling tools and Java Prior experience in developing and executing large scale analytics deliverables/ projects in the Financial Services\r\n Industry is a plus Solid experience of machine learning techniques Good presentation, communication and interpersonal skills Sense of ownership and servicing mindset to ensure efficient and effective customer service processes Applicants who are not contacted within 8 weeks may consider their applications unsuccessful and their personal data will be retained by the bank for a period up to two years. All information provided by applicants will be used for recruitment purposes only and will be used strictly in accordance with the\r\n bank’s personal data policies, a copy of which will be provided upon request. Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience N/A Employment Type Internship Benefits Five-day work week Company Website Company details China Construction Bank (Asia) Corporation Limited [“CCB (Asia)”] is the retail and commercial business platform of China Construction Bank Corporation\r\n [“CCB”] in Hong Kong. As of June 30, 2017, CCB (Asia) has 50 branches in Hong Kong and offers a wide array of banking products and services to customers, including consumer banking services, commercial banking services, corporate banking services, private\r\n banking services and cross-border financial services, etc.  We’re inviting high caliber professionals to share our vision and mark our success together. More Jobs from this employer Relationship Manager Trainee (May 2019 Intake) Posted on  5 hours ago Manager, Property & Facility Management Posted on  16-Apr-19 Wealth Planning Advisor (Insurance focused)   (Ref. no.: WPAI/CB/JDB) Posted on  16-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Software R&D Engineer (IoT, AI, Big Data)", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Software R&D Engineer (IoT, AI, Big Data)  OT Systems Ltd Shatin Area Salary negotiable Posted on 12 Apr 2019 Software R&D Engineer (IoT, AI, Big Data)  OT Systems Ltd Job Highlights Job Description We are a high growth company providing excellent opportunities for career advancement. We offer competitive salary package, generous fringe benefits and on-the-job\r\n training to high caliber candidates.  We are now seeking for a\r\n Software R&D Engineer . Conduct R&D works on mobile surveillance system Conduct R&D works on data analytics, data visualization, data warehousing and delivery of projects and product Develop big data infrastructure and development frameworks   Degree in Computer Science/ Computer Engineering/ Electronic Engineering/ Information Engineering/ or related fields.  Experience with one or more of the following program languages: C/C++ /Python/ OpenCV.  Preferable with electronics, IoT knowledge  Knowledge of software engineering processes and tools (e.g., programming proficiency in an object-oriented language, algorithms and data structures).  Excellent coding, problem solving, and debugging skills.   Internship & Fresh Graduate are also welcomed APPLY FOR THIS JOB Interested candidates please click\r\n APPLY  button to apply online enclosing your full resume with current and expected salary. \r\n Please note that only shortlisted candidate will be notified. All personal information will be treated in strict confidence and solely used for recruitment purposes. Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience 2 years Employment Type Full Time, Permanent Benefits Double pay, Education allowance, Five-day work week, Medical insurance Company details OT\r\n Systems is a Hong Kong home-grown solution provider and  manufacturer  of network transmission devices,\r\n mobile surveillance and various IoT solutions for private and public security. Being a Science and Technology Park company, we also work closely with the HKSAR Government on Smart City  applications. Founded in the early 2000s by a team of internationally\r\n experienced security industry professionals, OT Systems have been reputable for its reliable products, customer-focused support and technology expertise. Business is spread across Hong Kong, China, SE Asia, Europe and the Middle East. The company headquarters\r\n in Hong Kong and has factories in China and regional operations in Europe and SE Asia. Website:\r\n https://ots-iotsolutions.com/ More Jobs from this employer Technical Support Engineer / Project Supervisor - IoT Project Posted on  12-Apr-19 Account Executive / Sales Executive / Junior Sales Engineer - IoT Solutions Posted on  12-Apr-19 Assistant Engineer - IoT/Smart City Posted on  12-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Engineer (Big Data)", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Engineer (Big Data) China Mobile Hong Kong 中國移動香港 Tsuen Wan Area Posted on 12 Apr 2019 Engineer (Big Data) China Mobile Hong Kong 中國移動香港 Job Highlights Job Description CHINA MOBILE HONG KONG COMPANY LIMITED  (\"CMHK\") is the wholly-owned subsidiary of China Mobile Limited (HKEx: 941) (NYSE: CHL), which ranks 47th on the Fortune Global 500. Our company strives to offer superior service experience and to become the preferable digital partner for customers. We are preserving an environment with trust, responsibility and caring. At CMHK, we commit to maximizing people’s potential and paving the way toward success for every striver. We are now inviting high caliber professional to join us. Responsibilities : Assist Seniors to design and develop software for supporting operations in company Cloud and Big Data Platform Responsible to system implementation, including system upgrade and rollout Participation in system maintenance, daily operation and emergency operations. Provide technical support and guidance to end users. Documentation of solutions, including specifications, user guide, test plan, etc. Requirements: Degree in Computer Science / Computer Engineering / Information Engineering or related discipline 2 years or above hands-on experience in software development Hands on experience in open source development (Shell Script, PERL, PHP, Python, Java, etc.) Good Knowledge in database system (SybaseIQ, Oracle, MySQL, PostgreSQL, MongoDB, GreenPlum, Bigtable, Cassandra, etc.) Knowledge in Big Data Platform tools and applications development Experience in any other cloud technology is a high advantage  Knowledge in Virtualization technologies (such as VMware/KVM) Knowledge in networking (TCP/IP, LAN, WAN) Working experience in Telecom industry will be an advantage Knowledge in Linux based system (RedHat, Fedora, CentOS, Ubuntu, etc.) Creative, flexible and self initiative Willing to discover the latest technologies and techniques in software development Good presentation and documentation skills in Chinese &English Fresh graduate will also be considered When you work: 5 days work 8 hours/day What you enjoy: Double pay Discretionary Performance bonus Life insurance Medical insurance Meal allowance Education subsidies Birthday gift Marriage leave Birthday leave Staff discount CMHK is committed to be an equal opportunity employer. We offer exceptional benefits package and the opportunity to work in a challenging environment. Personal data provided by applicants will be treated strictly in accordance with our personal data policy and for recruitment purposes only. Additional Information Career Level Entry Level Qualification Degree Industry Job Function Years of Experience 2 years Employment Type Full Time, Permanent Benefits Double pay, Five-day work week, Medical insurance, Performance bonus Company Website Company details Passionate about network, mobile and tele-communication?  Excited to connecting people together through pioneering technologies?  Dedicated to expanding your full potential in the ever-changing and rapidly-growing market?  CMHK is definitely the right place for you.   More Jobs from this employer Programmer / Senior Programmer (Business Systems) Posted on  16-Apr-19 Site Engineer Posted on  16-Apr-19 Assistant Administration Manager Posted on  16-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Big Data and ETL Engineer - Financial Technology", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Big Data and ETL Engineer - Financial Technology Pinpoint Asia Limited Not Specified HK$30,000 - 45,000 /month (negotiable) Posted on 15 Apr 2019 Big Data and ETL Engineer - Financial Technology Pinpoint Asia Limited Job Highlights Job Description Our client, a well-known FinTech group is looking for a Big Data and ETL Engineer to join their Data and Analytics development team. The selected candidates will be working on large-scale data projects. Great remuneration and growth with sound project exposure. Responsibilities: Involve in Big Data model build and development Participate in the entire SDLC including user requirements collection, system design, development, documentation, and testing. Develop application and ETL scripts for big data analytics. Design and develop data storage strategy and architecture. Work with internal users and different stakeholders on requirements, design, and specifications. Role and Responsibilities: Hands-on experience in ETL and SQL development. Experience with Big Data technology like Spark, Flink, Kafka, Hadoop, Tensorflow etc. Experience with Python is preferred. Experience with traditional RDBMS and NoSQL Databases including Cassandra or MongoDB. Interest to learn new technologies. Excellent communication skills in English and Chinese. If this outstanding opportunity sounds like your next career move, please send your resume in Word format to  at and put  Big Data and ETL Engineer - Financial Technology    in the subject header. Data provided is for recruitment purposes only. Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience 3 years Employment Type Full Time, Permanent Benefits Five-day work week, Medical insurance Company Website Company details Headquartered in Hong Kong, Pinpoint Asia is the go-to Specialist Firm for Technology Recruitment To see all our open jobs please reach out to us at  https://pinpointasia.com/job - search/ More Jobs from this employer Cyber Security Architect - Global Enterprise Posted on  23 hours ago IT Services Management and Incident Manager - Leading Bank Posted on  23 hours ago Developer Evangelist - Regional API InsurTech Platform Posted on  16-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Big Data Analytics Modelling Analyst (Betting)", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Big Data Analytics Modelling Analyst (Betting) The Hong Kong Jockey Club Shatin Area Posted on 12 Apr 2019 Big Data Analytics Modelling Analyst (Betting) The Hong Kong Jockey Club Job Highlights Job Description The Department\r\n The Customer and International Business Development Division (C&I) is responsible for providing quality wagering experience marketing, and CRM to\r\n local and overseas customers of the Hong Kong Jockey Club. The ultimate aim is to provide an impressive total customer experience leading to sustainable turnover growth in a responsible manner. The Job You will  assist in the development of trading algorithmic models for new products and new markets to expand the existing portfolio of betting products provide strategic input to the development, implementation and delivery of product innovations along with pricing and service improvements and\r\n requirements assist in the development of all model and statistical analysis for automated trading tools assist in the development of Trading Systems and Quantitative Finance engines with the objective of improving efficiency and profits exclusively\r\n in the trading environment assist in ad-hoc projects About\r\n You  You should have  a degree in Computing, Mathematics, Statistics or related disciplines, MSc and above a real bonus\r\n minimum 3 years working experience, preferred in a modeling/analysis/statistics role (statistical, Artificial Intelligence & Operational Research\r\n techniques or other disciplines)  strong computational background, with experience in some of C#, VBA, Matlab, R, SQL and other data and code manipulation methodologies formal training in big data analysis and knowledge in usage of software named HADOOP a must a keen interest in sports and statistical analysis is essential as well as a good understanding of the gaming industry passion, enthusiasm and curiosity about Football Trading plus interests in other sports such as Horse Racing, Basketball, etc. fluency in written and spoken English \r\n The level of appointment will be commensurate with qualification and experience. A contract employment will be offered to the successful candidate. Contract\r\n renewal will be subject to mutual agreement between the Club and the individual.  Please send your resume, complete with expected salary and job reference by clicking \"Apply Now\" button or to: The Human Resources Department The Hong Kong Jockey Club 1 Sports Road, Happy Valley Hong Kong   Additional Information Career Level Middle Qualification Degree Industry Job Function Years of Experience 3 years Employment Type Contract, Full Time Benefits Gratuity, Performance bonus Company Website Company details Founded in 1884, The Hong Kong Jockey Club is a world-class racing club that acts continuously for the betterment of our society. The Club has a unique integrated business model, comprising racing\r\n and racecourse entertainment, a membership club, responsible sports wagering and lottery, and charities and community contribution. Through this model, the Club generates economic and social value for the community and supports the Government in combatting\r\n illegal gambling. In 2017/18, the Club made a record return to the Government of HK$22.6 billion in duty and profits tax and contributed HK$1.2 billion to the Lotteries Fund. Approved charity donations were HK$4.2 billion. The Club is Hong Kong's largest single\r\n taxpayer and one of the city’s major employers. Its Charities Trust is also one of the world's top ten charity donors. The Club is always \"riding high together for a better future\" with the people of Hong Kong.   香港賽馬會（「馬會」）成立於1884年，是致力建設更美好社會的世界級賽馬機構。馬會透過其結合賽馬及馬場娛樂、會員會所、有節制體育博彩及獎券，以及慈善及社區貢獻的獨特綜合營運模式，創造經濟及社會價值，並協助政府打擊非法賭博。2017/18年度，馬會透過各項博彩稅及利得稅，為政府庫房帶來破紀錄的226億港元收入，並向獎券基金撥款12億港元。另外，已審批慈善捐款達42億港元。馬會是全港最大的單一納稅機構，也是香港主要僱主之一，其慈善信託基金位列全球十大慈善捐助機構。馬會將繼續與香港市民「同心同步同進　共創更好未來」。 More Jobs from this employer Part-time Research Assistant Posted on  1 hour ago Veterinary Pharmacy Technician (One-year temporary) Posted on  2 hours ago Part-Time Customer Relations Assistant (TRC) Posted on  3 hours ago View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Big Data Developer", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Big Data Developer Moneysq Limited Central Salary provided Posted on 15 Apr 2019 Big Data Developer Moneysq Limited Job Highlights Job Description Identify and implement process enhancement opportunities associated with supporting the application area  Help to change the company to a data-driven organization  Enhance the current DataLake solution to meet the reporting requirements and data request for business initiatives and be the single point of contacts for all such requests on top of the DataLake/Tableau  Work with upstream Fintech and business teams to identify appropriate and correct data sources to be loaded into the DataLake based on users’ requests   Diploma or above in Computer Studies / Computer Science / Information Technology (I.T.) related disciplines with 2+ years of experience in software development, including design, implementation, debugging, and support  2 years or above experience in Data Warehouse reporting and SQL programming skills  Able to demonstrate systematic and logical reasoning   Tableau Reporting & Server management skills  Big Data development experience especially in MapR StreamSet, Python  Linux shell scripts development  Loan industry (either personal or property) knowledge We offer: Discretionary bonus Medical insurance Dental insurance Competitive annual leave days Birthday leave Anniversary leave Study leave Marriage leave Compassionate leave How to apply: Please send your resume with expected salary either by the function \"APPLY NOW\" or post. Postage address: Human Capital Department Moneysq Limited 4/F Wheelock House 20 Pedder Street Central Hong Kong   (We are an equal opportunity employer. Personal data collected will be used for recruitment purpose only. The unsuccessful applications will be destroyed after 6 months.) Additional Information Career Level Entry Level Qualification Degree Industry Job Function Years of Experience 3 years Employment Type Full Time, Permanent Benefits Dental insurance, Five-day work week, Medical insurance, Performance bonus Company Website Company details Who we are MoneySQ.com and its partners aim to be the undisputed leader in Online Lending Platform service. We incorporate the latest FinTech solutions into our online platform, ensuring a secure, robust yet user-friendly experience. At MoneySQ.com, we are committed to finding innovative new ways to utilize financial technology resources to greatly improve the online lending experience. Our professional team constantly seeks to create new solutions to better meet the financing needs of individuals and businesses today, while lowering costs and providing access to new avenues for wealth creation. Join us now and be part of our exciting journey At MoneySQ, we foster a culture of innovation, continuous improvement and collaboration. We strive to develop our talent and support life-long learning to fulfil their personal growth and career aspirations. We offer resources, competitive salary package and good benefit to our employees to keep them engaged at work. We are also committed to creating a positive working environment which value a healthy work-life balance. To cope with our rapid expansion, we are currently looking for high caliber and passionate individuals to join our growing team. More Jobs from this employer Analyst Programmer Posted on  15-Apr-19 Sales Executive Posted on  15-Apr-19 Python Developer Posted on  15-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."},
{"title": "Big Data Developer - ETL", "description": "jobsDB.com My jobsDB Resources Career Insights Download Our App or   JOB SEEKER My jobsDB Resources Career Insights Download Our App For Employers SETTINGS Country & Language Hong Kong (English) Log in Sign up Back to menu Hong Kong (English) Indonesia (English) Indonesia (Bahasa) Singapore (English) Thailand (English) ไทย (ภาษาไทย) Search Jobs Big Data Developer - ETL Venturenix Limited Not Specified Salary provided Posted on 15 Apr 2019 Big Data Developer - ETL Venturenix Limited Job Highlights Job Description We are looking for a skilled and proven BI/Data Engineer to play an integral role in the growth of their enterprise wide data resource capabilities. Y ou’ll\r\n thrive in a fast-paced innovative culture. As part of this team you will be creating and maintaining the data stores necessary to turn data into information that will be used for enterprise reports. \r\n Additional Information Career Level Not Specified Qualification Not Specified Industry Job Function Years of Experience Not Specified Employment Type Full Time Company details Venturenix is a recruitment company focusing on IT career placements in APAC, particularly Hong Kong.\r\n We provide consultative advise on your career not only based on our recruitment experience, but also based on our industry experience as our recruitment consultants were industry experts. i.e. We have been in your shoes.\r\n With the leverage from our parent company T12M (A private equity firm focusing on Tech firm investment), Venturenix is a recruitment firm that truly understand the latest trend of the IT market not only from human resources perspective, but\r\n also from an investment or Technology acquisition perspective. More Jobs from this employer Cloud Infrastructure Architect Posted on  23 hours ago IT Security Manager | HKD 45k-50k Posted on  15-Apr-19 Tableau Developer (Multiple positions) Posted on  15-Apr-19 View all jobs from this employer About JobsDB About jobsDB FAQ Career @ jobsDB Contact us Contact us International partners Bdjobs (Bandladesh) Brighter Monday (East Africa) Catho (Brazil) Jobberman (West Africa) JobStreet (S.E. Asia) Jora (Hong Kong) OCC Mundial (Mexico) Seaman Jobsite (Philippines) SEEK (Australia) Work Abroad (Philippines) Workana Zhaopin (China) Job Seekers Browse jobs Post resumes Job Alerts My jobsDB Career Insights Employers Post a job Search candidates Advertise with us Best Companies Connect Facebook Twitter jobsDB @ App Store jobsDB @ Google Play Privacy Statement Terms & Conditions Site Map Hong Kong (English) Privacy Statement Terms & Conditions Site Map Copyright © 1998-2019, jobsDB."}
]